Tekla.Structures.Geometry3d.FacetedBrep
The FacetedBrep class defines a faceted BREP.
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
var vertex = new[]
{
new Vector(0.0, 0.0, 0.0), // 0
new Vector(300.0, 0.0, 0.0), // 1
new Vector(300.0, 700.0, 0.0), // 2
new Vector(0.0, 700.0, 0.0), // 3
new Vector(300.0, 700.0, 0.0), // 4
new Vector(300.0, 700.0, 2000.0), // 5
new Vector(0.0, 700.0, 2000.0), // 6
new Vector(100.0, 100.0, 0.0), // 7
new Vector(200.0, 100.0, 0.0), // 8
new Vector(200.0, 200.0, 0.0), // 9
new Vector(100.0, 200.0, 0.0) // 10
};
var outerWires = new[]
{
new[] { 0, 1, 2, 3 },
new[] { 3, 4, 5, 6 }
};
var innerWires = new Dictionary<int,int[][]>
{
{ 0, new[] { new[] { 10, 9, 8, 7 } } }
};
var brep = new FacetedBrep(vertex, outerWires, innerWires);
Console.WriteLine("This BREP has {0} faces", brep.Faces.Count);
}
}

Tekla.Structures.Geometry3d.FacetedBrep.#ctor(Tekla.Structures.Geometry3d.Vector[],System.Int32[][],System.Collections.Generic.IDictionary{System.Int32,System.Int32[][]})
Initializes a new instance of the FacetedBrep class.
vertices: Vector of the faceted brep vertices.
outerWires: outerWires is an array of integer arrays, providing indices in the traversing order
for each outer loop/wire. The indices correspond to the position of a vertex in the vertices array."
innerWires: innerWires is an array of integer arrays, providing indices in the traversing order
for each inner loop/wire. The dictionary key for the innerWires is the Face index (0-origin).
The indices correspond to the position of a vertex in the vertices array."

Tekla.Structures.Geometry3d.FacetedBrep.#ctor(Tekla.Structures.Geometry3d.Vector[],System.Int32[][],System.Collections.Generic.IDictionary{System.Int32,System.Int32[][]},System.Collections.Generic.IList{Tekla.Structures.Geometry3d.IndirectPolymeshEdge})
Initializes a new instance of the FacetedBrep class.
vertices: Vector of the faceted brep vertices.
outerWires: outerWires is an array of integer arrays, providing indices in the traversing order
for each outer loop/wire. The indices correspond to the position of a vertex in the vertices array."
innerWires: innerWires is an array of integer arrays, providing indices in the traversing order
for each inner loop/wire. The dictionary key for the innerWires is the Face index (0-origin).
The indices correspond to the position of a vertex in the vertices array."
edges: The edge information as indirect edges.

Tekla.Structures.Geometry3d.FacetedBrep.Faces
Gets the faces.

Tekla.Structures.Geometry3d.FacetedBrep.InnerWires
Gets the inner wires.

Tekla.Structures.Geometry3d.FacetedBrep.OuterWires
Gets the outer wires.

Tekla.Structures.Geometry3d.FacetedBrep.GetEdges
Gets the edges.

Tekla.Structures.Geometry3d.FacetedBrep.Vertices
Gets the vertices.

Tekla.Structures.Geometry3d.FacetedBrep.CheckForTwoManifold
Gets a value indicating whether this instance is 2-manifold.
Returns: true if this instance is 2-manifold; otherwise false.

Tekla.Structures.Geometry3d.FacetedBrep.GetInnerFace(System.Int32)
Gets the inner face at the specified index.
faceIndex: The index of the face.
Returns: The array of vertex indexes for the inner face.

Tekla.Structures.Geometry3d.FacetedBrep.GetInnerFaceCount(System.Int32)
Gets the inner face count of the outer face at the specified index.
faceIndex: The index of the face.
Returns: The count of inner faces for the outer face.

Tekla.Structures.Geometry3d.FacetedBrep.GetOuterFace(System.Int32)
Gets the outer face at the specified index.
faceIndex: The index of the face.
Returns: The array of vertex indexes for the outer face.